{"sections":{"09cbc14f-55c5-437b-a312-bd45166000df":{"type":"terms-and-condition","blocks":{"template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-0":{"type":"questions","settings":{"terms_title_text":"Copyright and trademark"}},"template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-1":{"type":"answers","settings":{"terms_paragraph_text":"We reserve the right to update or modify these terms and conditions at any time without prior notice. Your use of shop.company.com and shop.beetle.com.sg following any such change constitutes your agreement to follow and be bound by the terms and conditions as changed. For this reason, we encourage you to review these terms and conditions whenever you use this website."}},"template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-2":{"type":"questions","settings":{"terms_title_text":"Limitations of liability"}},"template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-3":{"type":"answers","settings":{"terms_paragraph_text":"The Company Pte Ltd shall not assume any responsibility, and shall not be liable for, any damages to, or viruses that may infect, your computer, telecommunication equipment, or other property caused by or arising from your access to, use of, or browsing this website or your downloading of any materials, from this website. IN NO EVENT WILL THE COMPANY PRIVATE LIMITED NOR THEIR RESPECTIVE OFFICERS, DIRECTORS, EMPLOYEES, SHAREHOLDERS, AFFILIATES, AGENTS, SUCCESSORS, ASSIGNS, RETAIL PARTNERS NOR ANY PARTY INVOLVED IN THE CREATION, PRODUCTION OR TRANSMISSION OF THIS WEB SITE BE LIABLE TO ANY PARTY FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL DAMAGES (INCLUDING, WITHOUT LIMITATION, THOSE RESULTING FROM LOST PROFITS, LOST DATA OR BUSINESS INTERRUPTION) ARISING OUT OF THE USE, INABILITY TO USE, OR THE RESULTS OF USE OF THIS WEB SITE, ANY WEB SITES LINKED TO THIS WEB SITE, OR THE MATERIALS, INFORMATION OR SERVICES CONTAINED AT ANY OR ALL SUCH SITES, WHETHER BASED ON WARRANTY, CONTRACT, TORT OR ANY OTHER LEGAL THEORY AND WHETHER OR NOT ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. THE FOREGOING LIMITATIONS OF LIABILITY DO NOT APPLY TO THE EXTENT PROHIBITED BY LAW. PLEASE REFER TO YOUR LOCAL LAWS FOR ANY SUCH PROHIBITIONS."}},"template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-4":{"type":"questions","settings":{"terms_title_text":"Copyright and trademark"}},"template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-5":{"type":"answers","settings":{"terms_paragraph_text":"Unless otherwise indicated, material on this website, including but not limited to texts, images, illustrations, software, audio clips, video clips, animation files, is subject to the copyright and trademark rights of The Company Private Limited. Consequently, the material on this website may not be copied, reproduced, modified, posted, transmitted, distributed, in whole or in part in any form whatsoever, without the prior written consent of The Company Private Limited. All rights reserved."}},"0e07afc9-25fe-4292-9194-dd933b8eb4ac":{"type":"questions","settings":{"terms_title_text":"Products, content and specifications"}},"08c1d7db-640b-4d41-a518-5b6e0c8aa946":{"type":"answers","settings":{"terms_paragraph_text":"All features, content, specifications, products and prices of products and services described or depicted on this website are subject to change at any time without notice. Certain weights, measures and similar descriptions are approximate and are provided for convenience purposes only. We make all reasonable efforts to accurately display the attributes of our products, including the applicable colors; however, the actual color you see will depend on your computer system and we cannot guarantee that your computer will accurately display such colors. The inclusion of any products or services in this website at a particular time does not imply or warrant that these products or services will be available at any time. It is your responsibility to ascertain and obey all applicable local, state and international laws in regard to the possession, use and sale of any item purchased from this website. By placing an order, you represent that the products ordered will be used only in a lawful manner."}},"69dc0908-baaf-45a9-8119-3e2442e20908":{"type":"questions","settings":{"terms_title_text":"Shipping limitations"}},"e0590ba2-05c5-4854-857b-ae8a9fd68552":{"type":"answers","settings":{"terms_paragraph_text":"When an order is placed, it will be shipped to an address designated by the purchaser as long as that shipping address is compliant with the shipping restrictions contained on this website. All purchases from this website are made pursuant to a shipment contract. As a result, risk of loss and title for items purchased from this website pass to you upon delivery of the items to the carrier. You are responsible for filing any claims with carriers for damaged and\/or lost shipments."}},"63716c80-9b91-4d22-92b6-648bcccd0fb7":{"type":"questions","settings":{"terms_title_text":"Duties and taxes"}},"63cc6025-c774-46ab-856a-91d33106f893":{"type":"answers","settings":{"terms_paragraph_text":"You are responsible for duties and taxes outside Singapore. All items entering a foreign country are subject to customs inspection and assessment of the duties and taxes in accordance with that countrys national laws."}},"d2c80568-6d4a-41b1-b7a3-9842b0fe58e1":{"type":"questions","settings":{"terms_title_text":"Your account"}},"492c4af3-b12b-45a2-9b19-3571c9715c35":{"type":"answers","settings":{"terms_paragraph_text":"You are responsible for maintaining the confidentiality of your account and password information, and you agree to accept responsibility for all activities that occur under your account and password. This website and The Company Pte Ltd reserves the right to refuse service, terminate accounts remove or edit content or cancel orders."}},"a5531126-6498-427e-ac61-3abbfe3073b8":{"type":"answers","settings":{"terms_paragraph_text":"By placing an order, you warrant that you are over 18 years of age, and that you are providing shop.company.com or shop.beetle.com.sg with accurate, truthful information and that you have the authority to place the order."}},"bffbaf8f-8e37-43ac-921b-8a735a0e080d":{"type":"questions","settings":{"terms_title_text":"Exchange and refund policy (singapore outlets only)"}},"8949034b-b634-4ec4-bcaf-7e74cb3e0b3e":{"type":"answers","settings":{"terms_paragraph_text":"New, unused full-price merchandise purchased at store retail store may be exchange at any boutique with an original receipt within 7 days of purchase. After 7 days, the merchandise may not be exchanged."}},"e7d5e313-f645-4961-bd00-5fcc9767d7e9":{"type":"answers","settings":{"terms_paragraph_text":"We offer a no-refund policy on all merchandises, however, for merchandise qualifying for an exchange, item may be exchange for store credits which may be used at our Singapore outlets only."}},"4e310e70-ae82-4e73-8694-8c21400ddfe7":{"type":"answers","settings":{"terms_paragraph_text":"Merchandise on sale may not be exchanged or returned. All merchandise must be returned in sellable condition, otherwise, an exchange would not be allowed."}},"b5e13677-58b5-4468-a64d-93955f5a9d51":{"type":"answers","settings":{"terms_paragraph_text":"We reserve the right to reject any form of exchange without the original receipt."}},"09ed68cb-d061-48e5-9b39-455b2e31af7c":{"type":"questions","settings":{"terms_title_text":"Exchange and refund policy (online shop)"}},"ed8a2b91-a4df-4b21-9698-afcecb4f94ca":{"type":"answers","settings":{"terms_paragraph_text":"Electronic Communications When you visit this website and\/or send email to us, you consent to receive electronic communications from us. You agree that all agreements, notices, disclosures and other communications that we sent you electronically satisfy any legal requirement that such communications be in writing."}}},"block_order":["template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-0","template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-1","template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-2","template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-3","template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-4","template--19652231266615__09cbc14f-55c5-437b-a312-bd45166000df-168732685721d061de-5","0e07afc9-25fe-4292-9194-dd933b8eb4ac","08c1d7db-640b-4d41-a518-5b6e0c8aa946","69dc0908-baaf-45a9-8119-3e2442e20908","e0590ba2-05c5-4854-857b-ae8a9fd68552","63716c80-9b91-4d22-92b6-648bcccd0fb7","63cc6025-c774-46ab-856a-91d33106f893","d2c80568-6d4a-41b1-b7a3-9842b0fe58e1","492c4af3-b12b-45a2-9b19-3571c9715c35","a5531126-6498-427e-ac61-3abbfe3073b8","bffbaf8f-8e37-43ac-921b-8a735a0e080d","8949034b-b634-4ec4-bcaf-7e74cb3e0b3e","e7d5e313-f645-4961-bd00-5fcc9767d7e9","4e310e70-ae82-4e73-8694-8c21400ddfe7","b5e13677-58b5-4468-a64d-93955f5a9d51","09ed68cb-d061-48e5-9b39-455b2e31af7c","ed8a2b91-a4df-4b21-9698-afcecb4f94ca"],"settings":{"show_topimg":true,"terms_top_img":"shopify:\/\/shop_images\/faq.webp","terms_maintitle":"Terms and condition","heading_alignment":"center","terms_bg_color":"#f5f5f5","terms_title_color":"#131921","padding_top":50,"padding_bottom":50,"padding_top_1099":40,"padding_bottom_1099":40,"padding_top_989":40,"padding_bottom_989":40,"padding_top_840":30,"padding_bottom_840":30,"padding_top_767":30,"padding_bottom_767":30,"padding_top_640":20,"padding_bottom_640":20,"padding_top_480":20,"padding_bottom_480":20}}},"order":["09cbc14f-55c5-437b-a312-bd45166000df"]}